micropython/micropython/ports/cc3200/hal/rom_map.h
//*****************************************************************************
//
// Macros for the I2S API.
//
//*****************************************************************************
#ifdef ROM_I2SEnable
#define MAP_I2SEnable \
        ROM_I2SEnable
#else
#define MAP_I2SEnable \
        I2SEnable
#endif
#ifdef ROM_I2SDisable
#define MAP_I2SDisable \
        ROM_I2SDisable
#else
#define MAP_I2SDisable \
        I2SDisable
#endif
#ifdef ROM_I2SDataPut
#define MAP_I2SDataPut \
        ROM_I2SDataPut
#else
#define MAP_I2SDataPut \
        I2SDataPut
#endif
#ifdef ROM_I2SDataPutNonBlocking
#define MAP_I2SDataPutNonBlocking \
        ROM_I2SDataPutNonBlocking
#else
#define MAP_I2SDataPutNonBlocking \
        I2SDataPutNonBlocking
#endif
#ifdef ROM_I2SDataGet
#define MAP_I2SDataGet \
        ROM_I2SDataGet
#else
#define MAP_I2SDataGet \
        I2SDataGet
#endif
#ifdef ROM_I2SDataGetNonBlocking
#define MAP_I2SDataGetNonBlocking \
        ROM_I2SDataGetNonBlocking
#else
#define MAP_I2SDataGetNonBlocking \
        I2SDataGetNonBlocking
#endif
#ifdef ROM_I2SConfigSetExpClk
#define MAP_I2SConfigSetExpClk \
        ROM_I2SConfigSetExpClk
#else
#define MAP_I2SConfigSetExpClk \
        I2SConfigSetExpClk
#endif
#ifdef ROM_I2STxFIFOEnable
#define MAP_I2STxFIFOEnable \
        ROM_I2STxFIFOEnable
#else
#define MAP_I2STxFIFOEnable \
        I2STxFIFOEnable
#endif
#ifdef ROM_I2STxFIFODisable
#define MAP_I2STxFIFODisable \
        ROM_I2STxFIFODisable
#else
#define MAP_I2STxFIFODisable \
        I2STxFIFODisable
#endif
#ifdef ROM_I2SRxFIFOEnable
#define MAP_I2SRxFIFOEnable \
        ROM_I2SRxFIFOEnable
#else
#define MAP_I2SRxFIFOEnable \
        I2SRxFIFOEnable
#endif
#ifdef ROM_I2SRxFIFODisable
#define MAP_I2SRxFIFODisable \
        ROM_I2SRxFIFODisable
#else
#define MAP_I2SRxFIFODisable \
        I2SRxFIFODisable
#endif
#ifdef ROM_I2STxFIFOStatusGet
#define MAP_I2STxFIFOStatusGet \
        ROM_I2STxFIFOStatusGet
#else
#define MAP_I2STxFIFOStatusGet \
        I2STxFIFOStatusGet
#endif
#ifdef ROM_I2SRxFIFOStatusGet
#define MAP_I2SRxFIFOStatusGet \
        ROM_I2SRxFIFOStatusGet
#else
#define MAP_I2SRxFIFOStatusGet \
        I2SRxFIFOStatusGet
#endif
#ifdef ROM_I2SSerializerConfig
#define MAP_I2SSerializerConfig \
        ROM_I2SSerializerConfig
#else
#define MAP_I2SSerializerConfig \
        I2SSerializerConfig
#endif
#ifdef ROM_I2SIntEnable
#define MAP_I2SIntEnable \
        ROM_I2SIntEnable
#else
#define MAP_I2SIntEnable \
        I2SIntEnable
#endif
#ifdef ROM_I2SIntDisable
#define MAP_I2SIntDisable \
        ROM_I2SIntDisable
#else
#define MAP_I2SIntDisable \
        I2SIntDisable
#endif
#ifdef ROM_I2SIntStatus
#define MAP_I2SIntStatus \
        ROM_I2SIntStatus
#else
#define MAP_I2SIntStatus \
        I2SIntStatus
#endif
#ifdef ROM_I2SIntClear
#define MAP_I2SIntClear \
        ROM_I2SIntClear
#else
#define MAP_I2SIntClear \
        I2SIntClear
#endif
#ifdef ROM_I2SIntRegister
#define MAP_I2SIntRegister \
        ROM_I2SIntRegister
#else
#define MAP_I2SIntRegister \
        I2SIntRegister
#endif
#ifdef ROM_I2SIntUnregister
#define MAP_I2SIntUnregister \
        ROM_I2SIntUnregister
#else
#define MAP_I2SIntUnregister \
        I2SIntUnregister
#endif

//*****************************************************************************
//
// Macros for the GPIO API.
//
//*****************************************************************************
#ifdef ROM_GPIODirModeSet
#define MAP_GPIODirModeSet \
        ROM_GPIODirModeSet
#else
#define MAP_GPIODirModeSet \
        GPIODirModeSet
#endif
#ifdef ROM_GPIODirModeGet
#define MAP_GPIODirModeGet \
        ROM_GPIODirModeGet
#else
#define MAP_GPIODirModeGet \
        GPIODirModeGet
#endif
#ifdef ROM_GPIOIntTypeSet
#define MAP_GPIOIntTypeSet \
        ROM_GPIOIntTypeSet
#else
#define MAP_GPIOIntTypeSet \
        GPIOIntTypeSet
#endif
#ifdef ROM_GPIODMATriggerEnable
#define MAP_GPIODMATriggerEnable \
        ROM_GPIODMATriggerEnable
#else
#define MAP_GPIODMATriggerEnable \
        GPIODMATriggerEnable
#endif
#ifdef ROM_GPIODMATriggerDisable
#define MAP_GPIODMATriggerDisable \
        ROM_GPIODMATriggerDisable
#else
#define MAP_GPIODMATriggerDisable \
        GPIODMATriggerDisable
#endif
#ifdef ROM_GPIOIntTypeGet
#define MAP_GPIOIntTypeGet \
        ROM_GPIOIntTypeGet
#else
#define MAP_GPIOIntTypeGet \
        GPIOIntTypeGet
#endif
#ifdef ROM_GPIOIntEnable
#define MAP_GPIOIntEnable \
        ROM_GPIOIntEnable
#else
#define MAP_GPIOIntEnable \
        GPIOIntEnable
#endif
#ifdef ROM_GPIOIntDisable
#define MAP_GPIOIntDisable \
        ROM_GPIOIntDisable
#else
#define MAP_GPIOIntDisable \
        GPIOIntDisable
#endif
#ifdef ROM_GPIOIntStatus
#define MAP_GPIOIntStatus \
        ROM_GPIOIntStatus
#else
#define MAP_GPIOIntStatus \
        GPIOIntStatus
#endif
#ifdef ROM_GPIOIntClear
#define MAP_GPIOIntClear \
        ROM_GPIOIntClear
#else
#define MAP_GPIOIntClear \
        GPIOIntClear
#endif
#ifdef ROM_GPIOIntRegister
#define MAP_GPIOIntRegister \
        ROM_GPIOIntRegister
#else
#define MAP_GPIOIntRegister \
        GPIOIntRegister
#endif
#ifdef ROM_GPIOIntUnregister
#define MAP_GPIOIntUnregister \
        ROM_GPIOIntUnregister
#else
#define MAP_GPIOIntUnregister \
        GPIOIntUnregister
#endif
#ifdef ROM_GPIOPinRead
#define MAP_GPIOPinRead \
        ROM_GPIOPinRead
#else
#define MAP_GPIOPinRead \
        GPIOPinRead
#endif
#ifdef ROM_GPIOPinWrite
#define MAP_GPIOPinWrite \
        ROM_GPIOPinWrite
#else
#define MAP_GPIOPinWrite \
        GPIOPinWrite
#endif

//*****************************************************************************
//
// Macros for the AES API.
//
//*****************************************************************************
#ifdef ROM_AESConfigSet
#define MAP_AESConfigSet \
        ROM_AESConfigSet
#else
#define MAP_AESConfigSet \
        AESConfigSet
#endif
#ifdef ROM_AESKey1Set
#define MAP_AESKey1Set \
        ROM_AESKey1Set
#else
#define MAP_AESKey1Set \
        AESKey1Set
#endif
#ifdef ROM_AESKey2Set
#define MAP_AESKey2Set \
        ROM_AESKey2Set
#else
#define MAP_AESKey2Set \
        AESKey2Set
#endif
#ifdef ROM_AESKey3Set
#define MAP_AESKey3Set \
        ROM_AESKey3Set
#else
#define MAP_AESKey3Set \
        AESKey3Set
#endif
#ifdef ROM_AESIVSet
#define MAP_AESIVSet \
        ROM_AESIVSet
#else
#define MAP_AESIVSet \
        AESIVSet
#endif
#ifdef ROM_AESTagRead
#define MAP_AESTagRead \
        ROM_AESTagRead
#else
#define MAP_AESTagRead \
        AESTagRead
#endif
#ifdef ROM_AESDataLengthSet
#define MAP_AESDataLengthSet \
        ROM_AESDataLengthSet
#else
#define MAP_AESDataLengthSet \
        AESDataLengthSet
#endif
#ifdef ROM_AESAuthDataLengthSet
#define MAP_AESAuthDataLengthSet \
        ROM_AESAuthDataLengthSet
#else
#define MAP_AESAuthDataLengthSet \
        AESAuthDataLengthSet
#endif
#ifdef ROM_AESDataReadNonBlocking
#define MAP_AESDataReadNonBlocking \
        ROM_AESDataReadNonBlocking
#else
#define MAP_AESDataReadNonBlocking \
        AESDataReadNonBlocking
#endif
#ifdef ROM_AESDataRead
#define MAP_AESDataRead \
        ROM_AESDataRead
#else
#define MAP_AESDataRead \
        AESDataRead
#endif
#ifdef ROM_AESDataWriteNonBlocking
#define MAP_AESDataWriteNonBlocking \
        ROM_AESDataWriteNonBlocking
#else
#define MAP_AESDataWriteNonBlocking \
        AESDataWriteNonBlocking
#endif
#ifdef ROM_AESDataWrite
#define MAP_AESDataWrite \
        ROM_AESDataWrite
#else
#define MAP_AESDataWrite \
        AESDataWrite
#endif
#ifdef ROM_AESDataProcess
#define MAP_AESDataProcess \
        ROM_AESDataProcess
#else
#define MAP_AESDataProcess \
        AESDataProcess
#endif
#ifdef ROM_AESDataMAC
#define MAP_AESDataMAC \
        ROM_AESDataMAC
#else
#define MAP_AESDataMAC \
        AESDataMAC
#endif
#ifdef ROM_AESDataProcessAE
#define MAP_AESDataProcessAE \
        ROM_AESDataProcessAE
#else
#define MAP_AESDataProcessAE \
        AESDataProcessAE
#endif
#ifdef ROM_AESIntStatus
#define MAP_AESIntStatus \
        ROM_AESIntStatus
#else
#define MAP_AESIntStatus \
        AESIntStatus
#endif
#ifdef ROM_AESIntEnable
#define MAP_AESIntEnable \
        ROM_AESIntEnable
#else
#define MAP_AESIntEnable \
        AESIntEnable
#endif
#ifdef ROM_AESIntDisable
#define MAP_AESIntDisable \
        ROM_AESIntDisable
#else
#define MAP_AESIntDisable \
        AESIntDisable
#endif
#ifdef ROM_AESIntClear
#define MAP_AESIntClear \
        ROM_AESIntClear
#else
#define MAP_AESIntClear \
        AESIntClear
#endif
#ifdef ROM_AESIntRegister
#define MAP_AESIntRegister \
        ROM_AESIntRegister
#else
#define MAP_AESIntRegister \
        AESIntRegister
#endif
#ifdef ROM_AESIntUnregister
#define MAP_AESIntUnregister \
        ROM_AESIntUnregister
#else
#define MAP_AESIntUnregister \
        AESIntUnregister
#endif
#ifdef ROM_AESDMAEnable
#define MAP_AESDMAEnable \
        ROM_AESDMAEnable
#else
#define MAP_AESDMAEnable \
        AESDMAEnable
#endif
#ifdef ROM_AESDMADisable
#define MAP_AESDMADisable \
        ROM_AESDMADisable
#else
#define MAP_AESDMADisable \
        AESDMADisable
#endif

//*****************************************************************************
//
// Macros for the DES API.
//
//*****************************************************************************
#ifdef ROM_DESConfigSet
#define MAP_DESConfigSet \
        ROM_DESConfigSet
#else
#define MAP_DESConfigSet \
        DESConfigSet
#endif
#ifdef ROM_DESDataRead
#define MAP_DESDataRead \
        ROM_DESDataRead
#else
#define MAP_DESDataRead \
        DESDataRead
#endif
#ifdef ROM_DESDataReadNonBlocking
#define MAP_DESDataReadNonBlocking \
        ROM_DESDataReadNonBlocking
#else
#define MAP_DESDataReadNonBlocking \
        DESDataReadNonBlocking
#endif
#ifdef ROM_DESDataProcess
#define MAP_DESDataProcess \
        ROM_DESDataProcess
#else
#define MAP_DESDataProcess \
        DESDataProcess
#endif
#ifdef ROM_DESDataWrite
#define MAP_DESDataWrite \
        ROM_DESDataWrite
#else
#define MAP_DESDataWrite \
        DESDataWrite
#endif
#ifdef ROM_DESDataWriteNonBlocking
#define MAP_DESDataWriteNonBlocking \
        ROM_DESDataWriteNonBlocking
#else
#define MAP_DESDataWriteNonBlocking \
        DESDataWriteNonBlocking
#endif
#ifdef ROM_DESDMADisable
#define MAP_DESDMADisable \
        ROM_DESDMADisable
#else
#define MAP_DESDMADisable \
        DESDMADisable
#endif
#ifdef ROM_DESDMAEnable
#define MAP_DESDMAEnable \
        ROM_DESDMAEnable
#else
#define MAP_DESDMAEnable \
        DESDMAEnable
#endif
#ifdef ROM_DESIntClear
#define MAP_DESIntClear \
        ROM_DESIntClear
#else
#define MAP_DESIntClear \
        DESIntClear
#endif
#ifdef ROM_DESIntDisable
#define MAP_DESIntDisable \
        ROM_DESIntDisable
#else
#define MAP_DESIntDisable \
        DESIntDisable
#endif
#ifdef ROM_DESIntEnable
#define MAP_DESIntEnable \
        ROM_DESIntEnable
#else
#define MAP_DESIntEnable \
        DESIntEnable
#endif
#ifdef ROM_DESIntRegister
#define MAP_DESIntRegister \
        ROM_DESIntRegister
#else
#define MAP_DESIntRegister \
        DESIntRegister
#endif
#ifdef ROM_DESIntStatus
#define MAP_DESIntStatus \
        ROM_DESIntStatus
#else
#define MAP_DESIntStatus \
        DESIntStatus
#endif
#ifdef ROM_DESIntUnregister
#define MAP_DESIntUnregister \
        ROM_DESIntUnregister
#else
#define MAP_DESIntUnregister \
        DESIntUnregister
#endif
#ifdef ROM_DESIVSet
#define MAP_DESIVSet \
        ROM_DESIVSet
#else
#define MAP_DESIVSet \
        DESIVSet
#endif
#ifdef ROM_DESKeySet
#define MAP_DESKeySet \
        ROM_DESKeySet
#else
#define MAP_DESKeySet \
        DESKeySet
#endif
#ifdef ROM_DESDataLengthSet
#define MAP_DESDataLengthSet \
        ROM_DESDataLengthSet
#else
#define MAP_DESDataLengthSet \
        DESDataLengthSet
#endif

//*****************************************************************************
//
// Macros for the SHAMD5 API.
//
//*****************************************************************************
#ifdef ROM_SHAMD5ConfigSet
#define MAP_SHAMD5ConfigSet \
        ROM_SHAMD5ConfigSet
#else
#define MAP_SHAMD5ConfigSet \
        SHAMD5ConfigSet
#endif
#ifdef ROM_SHAMD5DataProcess
#define MAP_SHAMD5DataProcess \
        ROM_SHAMD5DataProcess
#else
#define MAP_SHAMD5DataProcess \
        SHAMD5DataProcess
#endif
#ifdef ROM_SHAMD5DataWrite
#define MAP_SHAMD5DataWrite \
        ROM_SHAMD5DataWrite
#else
#define MAP_SHAMD5DataWrite \
        SHAMD5DataWrite
#endif
#ifdef ROM_SHAMD5DataWriteNonBlocking
#define MAP_SHAMD5DataWriteNonBlocking \
        ROM_SHAMD5DataWriteNonBlocking
#else
#define MAP_SHAMD5DataWriteNonBlocking \
        SHAMD5DataWriteNonBlocking
#endif
#ifdef ROM_SHAMD5DMADisable
#define MAP_SHAMD5DMADisable \
        ROM_SHAMD5DMADisable
#else
#define MAP_SHAMD5DMADisable \
        SHAMD5DMADisable
#endif
#ifdef ROM_SHAMD5DMAEnable
#define MAP_SHAMD5DMAEnable \
        ROM_SHAMD5DMAEnable
#else
#define MAP_SHAMD5DMAEnable \
        SHAMD5DMAEnable
#endif
#ifdef ROM_SHAMD5DataLengthSet
#define MAP_SHAMD5DataLengthSet \
        ROM_SHAMD5DataLengthSet
#else
#define MAP_SHAMD5DataLengthSet \
        SHAMD5DataLengthSet
#endif
#ifdef ROM_SHAMD5HMACKeySet
#define MAP_SHAMD5HMACKeySet \
        ROM_SHAMD5HMACKeySet
#else
#define MAP_SHAMD5HMACKeySet \
        SHAMD5HMACKeySet
#endif
#ifdef ROM_SHAMD5HMACPPKeyGenerate
#define MAP_SHAMD5HMACPPKeyGenerate \
        ROM_SHAMD5HMACPPKeyGenerate
#else
#define MAP_SHAMD5HMACPPKeyGenerate \
        SHAMD5HMACPPKeyGenerate
#endif
#ifdef ROM_SHAMD5HMACPPKeySet
#define MAP_SHAMD5HMACPPKeySet \
        ROM_SHAMD5HMACPPKeySet
#else
#define MAP_SHAMD5HMACPPKeySet \
        SHAMD5HMACPPKeySet
#endif
#ifdef ROM_SHAMD5HMACProcess
#define MAP_SHAMD5HMACProcess \
        ROM_SHAMD5HMACProcess
#else
#define MAP_SHAMD5HMACProcess \
        SHAMD5HMACProcess
#endif
#ifdef ROM_SHAMD5IntClear
#define MAP_SHAMD5IntClear \
        ROM_SHAMD5IntClear
#else
#define MAP_SHAMD5IntClear \
        SHAMD5IntClear
#endif
#ifdef ROM_SHAMD5IntDisable
#define MAP_SHAMD5IntDisable \
        ROM_SHAMD5IntDisable
#else
#define MAP_SHAMD5IntDisable \
        SHAMD5IntDisable
#endif
#ifdef ROM_SHAMD5IntEnable
#define MAP_SHAMD5IntEnable \
        ROM_SHAMD5IntEnable
#else
#define MAP_SHAMD5IntEnable \
        SHAMD5IntEnable
#endif
#ifdef ROM_SHAMD5IntRegister
#define MAP_SHAMD5IntRegister \
        ROM_SHAMD5IntRegister
#else
#define MAP_SHAMD5IntRegister \
        SHAMD5IntRegister
#endif
#ifdef ROM_SHAMD5IntStatus
#define MAP_SHAMD5IntStatus \
        ROM_SHAMD5IntStatus
#else
#define MAP_SHAMD5IntStatus \
        SHAMD5IntStatus
#endif
#ifdef ROM_SHAMD5IntUnregister
#define MAP_SHAMD5IntUnregister \
        ROM_SHAMD5IntUnregister
#else
#define MAP_SHAMD5IntUnregister \
        SHAMD5IntUnregister
#endif
#ifdef ROM_SHAMD5ResultRead
#define MAP_SHAMD5ResultRead \
        ROM_SHAMD5ResultRead
#else
#define MAP_SHAMD5ResultRead \
        SHAMD5ResultRead
#endif

//*****************************************************************************
//
// Macros for the CRC API.
//
//*****************************************************************************
#ifdef ROM_CRCConfigSet
#define MAP_CRCConfigSet \
        ROM_CRCConfigSet
#else
#define MAP_CRCConfigSet \
        CRCConfigSet
#endif
#ifdef ROM_CRCDataProcess
#define MAP_CRCDataProcess \
        ROM_CRCDataProcess
#else
#define MAP_CRCDataProcess \
        CRCDataProcess
#endif
#ifdef ROM_CRCDataWrite
#define MAP_CRCDataWrite \
        ROM_CRCDataWrite
#else
#define MAP_CRCDataWrite \
        CRCDataWrite
#endif
#ifdef ROM_CRCResultRead
#define MAP_CRCResultRead \
        ROM_CRCResultRead
#else
#define MAP_CRCResultRead \
        CRCResultRead
#endif
#ifdef ROM_CRCSeedSet
#define MAP_CRCSeedSet \
        ROM_CRCSeedSet
#else
#define MAP_CRCSeedSet \
        CRCSeedSet
#endif

//*****************************************************************************
//
// Macros for the SDHOST API.
//
//*****************************************************************************
#ifdef ROM_SDHostCmdReset
#define MAP_SDHostCmdReset \
        ROM_SDHostCmdReset
#else
#define MAP_SDHostCmdReset \
        SDHostCmdReset
#endif
#ifdef ROM_SDHostInit
#define MAP_SDHostInit \
        ROM_SDHostInit
#else
#define MAP_SDHostInit \
        SDHostInit
#endif
#ifdef ROM_SDHostCmdSend
#define MAP_SDHostCmdSend \
        ROM_SDHostCmdSend
#else
#define MAP_SDHostCmdSend \
        SDHostCmdSend
#endif
#ifdef ROM_SDHostIntRegister
#define MAP_SDHostIntRegister \
        ROM_SDHostIntRegister
#else
#define MAP_SDHostIntRegister \
        SDHostIntRegister
#endif
#ifdef ROM_SDHostIntUnregister
#define MAP_SDHostIntUnregister \
        ROM_SDHostIntUnregister
#else
#define MAP_SDHostIntUnregister \
        SDHostIntUnregister
#endif
#ifdef ROM_SDHostIntEnable
#define MAP_SDHostIntEnable \
        ROM_SDHostIntEnable
#else
#define MAP_SDHostIntEnable \
        SDHostIntEnable
#endif
#ifdef ROM_SDHostIntDisable
#define MAP_SDHostIntDisable \
        ROM_SDHostIntDisable
#else
#define MAP_SDHostIntDisable \
        SDHostIntDisable
#endif
#ifdef ROM_SDHostIntStatus
#define MAP_SDHostIntStatus \
        ROM_SDHostIntStatus
#else
#define MAP_SDHostIntStatus \
        SDHostIntStatus
#endif
#ifdef ROM_SDHostIntClear
#define MAP_SDHostIntClear \
        ROM_SDHostIntClear
#else
#define MAP_SDHostIntClear \
        SDHostIntClear
#endif
#ifdef ROM_SDHostRespStatus
#define MAP_SDHostRespStatus \
        ROM_SDHostRespStatus
#else
#define MAP_SDHostRespStatus \
        SDHostRespStatus
#endif
#ifdef ROM_SDHostRespGet
#define MAP_SDHostRespGet \
        ROM_SDHostRespGet
#else
#define MAP_SDHostRespGet \
        SDHostRespGet
#endif
#ifdef ROM_SDHostBlockSizeSet
#define MAP_SDHostBlockSizeSet \
        ROM_SDHostBlockSizeSet
#else
#define MAP_SDHostBlockSizeSet \
        SDHostBlockSizeSet
#endif
#ifdef ROM_SDHostBlockCountSet
#define MAP_SDHostBlockCountSet \
        ROM_SDHostBlockCountSet
#else
#define MAP_SDHostBlockCountSet \
        SDHostBlockCountSet
#endif
#ifdef ROM_SDHostDataNonBlockingWrite
#define MAP_SDHostDataNonBlockingWrite \
        ROM_SDHostDataNonBlockingWrite
#else
#define MAP_SDHostDataNonBlockingWrite \
        SDHostDataNonBlockingWrite
#endif
#ifdef ROM_SDHostDataNonBlockingRead
#define MAP_SDHostDataNonBlockingRead \
        ROM_SDHostDataNonBlockingRead
#else
#define MAP_SDHostDataNonBlockingRead \
        SDHostDataNonBlockingRead
#endif
#ifdef ROM_SDHostDataWrite
#define MAP_SDHostDataWrite \
        ROM_SDHostDataWrite
#else
#define MAP_SDHostDataWrite \
        SDHostDataWrite
#endif
#ifdef ROM_SDHostDataRead
#define MAP_SDHostDataRead \
        ROM_SDHostDataRead
#else
#define MAP_SDHostDataRead \
        SDHostDataRead
#endif
#ifdef ROM_SDHostSetExpClk
#define MAP_SDHostSetExpClk \
        ROM_SDHostSetExpClk
#else
#define MAP_SDHostSetExpClk \
        SDHostSetExpClk
#endif

